{
  "irVersion": "1.0",
  "project": "brandkit",
  "repository": "https://github.com/grokify/brandkit",
  "versioning": "semver",
  "commitConvention": "conventional",
  "releases": [
    {
      "version": "v0.3.0",
      "date": "2026-02-14",
      "highlights": [
        { "description": "Interactive coordinate picker tool for creating precise SVG polygons from images" },
        { "description": "TypeScript library with 100% test coverage for coordinate picker functionality" },
        { "description": "Saviynt brand icons with mathematically precise geometry" }
      ],
      "added": [
        { "description": "Saviynt brand icons (`icon_orig.svg`, `icon_white.svg`, `icon_color.svg`) with precise parallelogram geometry", "commit": "1a3ee82" },
        { "description": "Interactive coordinate picker tool (`docs/coordinate-picker.html`) for SVG polygon creation via GitHub Pages", "commit": "3d02efa" },
        { "description": "TypeScript library (`tools/src/coordinate-picker.ts`) with state management, SVG generation, and serialization", "commit": "3d02efa" },
        { "description": "Multi-shape support with color-coded markers and pin sharing across shapes", "commit": "3d02efa" },
        { "description": "Zoom controls (50%-400%) for precise coordinate selection", "commit": "3d02efa" },
        { "description": "GitHub Actions workflow (`test-tools.yaml`) for TypeScript tests on Node.js 20.x/22.x across platforms", "commit": "6749dff" }
      ],
      "tests": [
        { "description": "63 unit tests for coordinate picker with 100% coverage on statements, branches, functions, and lines", "commit": "a0591a9" }
      ],
      "infrastructure": [
        { "description": "Move coordinate picker to `docs/` for GitHub Pages static hosting", "commit": "0c238ab" }
      ]
    },
    {
      "version": "v0.2.0",
      "date": "2026-01-25",
      "highlights": [
        { "description": "Go library APIs for programmatic icon retrieval and processing" },
        { "description": "New CLI commands `brandkit color` and `brandkit verify-all`" },
        { "description": "17 new brand icons and 42 new `icon_color.svg` files (total: 52 brands)" }
      ],
      "added": [
        { "description": "Go library API for embedded icon retrieval: `GetIcon`, `GetIconWhite`, `GetIconColor`, `GetIconOrig`, `ListIcons`, `IconExists`, `NormalizeIconName`", "commit": "2c95642" },
        { "description": "Go library API for icon processing: `ProcessWhite`, `ProcessColor` for programmatic SVG processing", "commit": "ea6e409" },
        { "description": "Go library API for recursive verification: `svg.ListSVGFilesRecursive`, `verify.DirectoryRecursive`", "commit": "ab5324f" },
        { "description": "CLI command `brandkit color` for creating centered color icons preserving original colors", "commit": "8a8eecc" },
        { "description": "CLI command `brandkit verify-all` for recursive pure vector verification (CI-friendly)", "commit": "8a8eecc" },
        { "description": "17 new brand icons: bolt, bootstrap, dart, flutter, go, javascript, kotlin, lovable, openapi, postgresql, postman, python, react, replit, spring, v0, windsurf (total: 52 brands)", "commit": "205a287" },
        { "description": "42 new `icon_color.svg` files for all brands with transparent backgrounds", "commit": "bcf0c80" },
        { "description": "GitHub Actions workflow `verify.yaml` for automated icon validation on PR/push", "commit": "0358ff9" }
      ],
      "changed": [
        { "description": "Renamed `gcp` brand directory to `google-gcp` for clarity and consistency", "commit": "78afca3" },
        { "description": "Refactored `brandkit white` CLI to use `ProcessWhite` library function", "commit": "8a8eecc" }
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2026-01-24",
      "highlights": [
        { "description": "CLI toolkit for one-command SVG icon processing workflows" },
        { "description": "Go library packages for SVG analysis, conversion, and verification" },
        { "description": "Brand asset library with 36 brand icon directories" }
      ],
      "added": [
        { "description": "CLI command `brandkit white` for one-step white icon generation with background removal, color conversion, centering, and verification", "commit": "03f1bad" },
        { "description": "CLI command `brandkit convert` for SVG color conversion with support for hex, shorthand, and named colors", "commit": "03f1bad" },
        { "description": "CLI command `brandkit process` for full SVG processing pipeline (convert, center, verify)", "commit": "03f1bad" },
        { "description": "CLI command `brandkit analyze` for SVG geometry analysis (centering, padding, viewBox optimization)", "commit": "03f1bad" },
        { "description": "CLI command `brandkit verify` for pure vector validation (detects embedded base64, data URIs, binary references)", "commit": "03f1bad" },
        { "description": "Public `svg` package with `BoundingBox`, `ViewBox`, `ParsePath`, `CalculatePathBounds`, and file utilities", "commit": "cadcdad" },
        { "description": "Public `svg/convert` package for programmatic SVG color conversion with background removal and mask preservation", "commit": "cadcdad" },
        { "description": "Public `svg/analyze` package for programmatic SVG geometry analysis", "commit": "cadcdad" },
        { "description": "Public `svg/verify` package for programmatic pure vector validation", "commit": "cadcdad" },
        { "description": "Brand asset library with 36 brand icon directories and standardized SVG variants", "commit": "b476880" }
      ]
    }
  ]
}
