{
  "ir_version": "1.0",
  "project": "brandkit",
  "repository": "https://github.com/grokify/brandkit",
  "versioning": "semver",
  "commit_convention": "conventional",
  "releases": [
    {
      "version": "0.2.0",
      "date": "2026-01-25",
      "added": [
        {
          "description": "Go library API for embedded icon retrieval: `GetIcon`, `GetIconWhite`, `GetIconColor`, `GetIconOrig`, `ListIcons`, `IconExists`, `NormalizeIconName`",
          "commit": "2c95642"
        },
        {
          "description": "Go library API for icon processing: `ProcessWhite`, `ProcessColor` for programmatic SVG processing",
          "commit": "ea6e409"
        },
        {
          "description": "Go library API for recursive verification: `svg.ListSVGFilesRecursive`, `verify.DirectoryRecursive`",
          "commit": "ab5324f"
        },
        {
          "description": "CLI command `brandkit color` for creating centered color icons preserving original colors",
          "commit": "8a8eecc"
        },
        {
          "description": "CLI command `brandkit verify-all` for recursive pure vector verification (CI-friendly)",
          "commit": "8a8eecc"
        },
        {
          "description": "17 new brand icons: bolt, bootstrap, dart, flutter, go, javascript, kotlin, lovable, openapi, postgresql, postman, python, react, replit, spring, v0, windsurf (total: 52 brands)",
          "commit": "205a287"
        },
        {
          "description": "42 new `icon_color.svg` files for all brands with transparent backgrounds",
          "commit": "bcf0c80"
        },
        {
          "description": "GitHub Actions workflow `verify.yaml` for automated icon validation on PR/push",
          "commit": "0358ff9"
        }
      ],
      "changed": [
        {
          "description": "Renamed `gcp` brand directory to `google-gcp` for clarity and consistency",
          "commit": "78afca3"
        },
        {
          "description": "Refactored `brandkit white` CLI to use `ProcessWhite` library function",
          "commit": "8a8eecc"
        }
      ]
    },
    {
      "version": "0.1.0",
      "date": "2026-01-24",
      "added": [
        {
          "description": "CLI command `brandkit white` for one-step white icon generation with background removal, color conversion, centering, and verification"
        },
        {
          "description": "CLI command `brandkit convert` for SVG color conversion with support for hex, shorthand, and named colors"
        },
        {
          "description": "CLI command `brandkit process` for full SVG processing pipeline (convert, center, verify)"
        },
        {
          "description": "CLI command `brandkit analyze` for SVG geometry analysis (centering, padding, viewBox optimization)"
        },
        {
          "description": "CLI command `brandkit verify` for pure vector validation (detects embedded base64, data URIs, binary references)"
        },
        {
          "description": "Public `svg` package with `BoundingBox`, `ViewBox`, `ParsePath`, `CalculatePathBounds`, and file utilities"
        },
        {
          "description": "Public `svg/convert` package for programmatic SVG color conversion with background removal and mask preservation"
        },
        {
          "description": "Public `svg/analyze` package for programmatic SVG geometry analysis"
        },
        {
          "description": "Public `svg/verify` package for programmatic pure vector validation"
        },
        {
          "description": "Brand asset library with 36 brand icon directories and standardized SVG variants"
        }
      ]
    }
  ]
}
